/*****************************************************
 * 文件名：dac7512.c
 * 说明：对DA进行初始化及控制DA输出值。
 * 作者：曾新贵
 * 时间：2013年2月28日
 ****************************************************/
#include <MSp430G2553.h>
#include "dac7512.h"
/*******************************
 * 函数名：dac7512_init
 * 入口参数：无
 * 出口参数：无
 * 说明：对DA进行初始化。
********************************/
void dac7512_init()
{
	P1DIR |= (DAT | CLK | SYNC);
	SYNC_1;
	CLK_1;
	DAT_0;
}
/*******************************
 * 函数名：dac7512_out
 * 入口参数：无
 * 出口参数：无
 * 说明：改变DA输出值。
********************************/
void dac7512_out(unsigned int dat)
{
	unsigned char i;
	dat &= 0x0fff;

	SYNC_1;
	DAT_0;
	CLK_1;
	SYNC_0;
	for(i = 0; i< 16; i++)
	{
		if(dat & 0x8000)
			DAT_1;
		else
			DAT_0;
		CLK_0;
		_delay_cycles(4);
		CLK_1;
		dat <<= 1;
	}
	SYNC_1;
}

